ProgessBase/Documents/АмортизацияОСМеждународный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АмортизацияОСМеждународный</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗатратыМеждународныйУчет</xr:Item>
				<xr:Item>InformationRegister.ОсновныеСредстваМеждународныйУчет</xr:Item>
				<xr:Item>AccumulationRegister.НезавершенноеПроизводствоМеждународныйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ис_РасходыБудущихПериодовМеждународныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДС_ВидыОперацийАмортизацияОС_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВыпущеннойПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МетодыНачисленияАмортизацииОСМеждународный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ОсновныеСредстваМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеСредстваМеждународныйУчет</Name>
			<Comment>(Упр) Сведения об объектах ОС  для целей международного учета</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, на балансе которой учитывется объект ОС в международном учете</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Comment>Дата принятия объекта к международному учету</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестонахождениеОбъекта</Name>
					<Comment>Подразделение организации, в котором находится объект ОС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Comment>Счет учета в плане счетов Международный</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Comment>Срок полезного использования в месяцах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Comment>Булево - начиляется амортизация или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодНачисленияАмортизации</Name>
					<Comment>Метод начисления амортизации по международному учету</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыНачисленияАмортизацииОСМеждународный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Comment>Счет, на котором накапливается начисленная амортизация</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная (историческая) стоимость объекта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СправедливаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Comment>Стоимость, которая должна остаться после истечения срока полезного использования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Comment>Счет учета, в дебет которого относятся амортизационные отчисления</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Comment>Субконто первого уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Comment>Субконто второго уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Comment>Субконто третьего уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредполагаемыйОбъемПродукции</Name>
					<Comment>Используется при амортизации пропорционально объему продукции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНачисленнойАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УбытокОтОбесценения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентУскорения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСниженияСтоимости</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ис_Лизинг</Name>
					<Comment>ОС находится в лизинге</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ДС_ОбъемВыпускаДляРасчетаАмортизацииОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДС_ОбъемВыпускаДляРасчетаАмортизацииОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВыпущеннойПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроизводственнаяЛиния</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодАмортизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ис_ЗатратыБудущихПериодовМеждународный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ис_ЗатратыБудущихПериодовМеждународный</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасходыБудущихПериодов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасходыБудущихПериодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/УчетнаяПолитикаМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаМеждународныйУчет</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодРасчетаДанныхВновьПриобретенныхКомпаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыРасчетаДанныхВновьПриобретенныхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодУчетаИнвестиционнойСобственности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодАмортизацииНМА</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОпределенияПроцентаВыполненияДоговораПодряда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОпределенияПроцентаВыполненияДоговораПодряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОценкиОсновныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодПереоценкиОС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыПереоценкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетВыбытияОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ис_РасходыБудущихПериодовМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ис_РасходыБудущихПериодовМеждународныйУчет</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Documents/АмортизацияОСМеждународный/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА


#Если Клиент Тогда
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура УстановитьСубконтоПроводки(Куда, Счет, ВидСубконто, Значение)

	Если Счет.ВидыСубконто.Найти(ВидСубконто, "ВидСубконто") <> Неопределено Тогда
		Куда[ВидСубконто] = Значение;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// is ЯннуровВФ нач 20140522 ЗР-0И-001230
	лЗапрос = Новый Запрос;
	лЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АмортизацияОСМеждународныйОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	Документ.АмортизацияОСМеждународный.ОсновныеСредства КАК АмортизацияОСМеждународныйОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&Период, ) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних
	|		ПО АмортизацияОСМеждународныйОсновныеСредства.ОсновноеСредство = ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство
	|ГДЕ
	|	АмортизацияОСМеждународныйОсновныеСредства.Ссылка = &Ссылка
	|	И (ОсновныеСредстваМеждународныйУчетСрезПоследних.ДатаПринятияКУчету >= &НачалоМесяца
	|			ИЛИ ОсновныеСредстваМеждународныйУчетСрезПоследних.ДатаПринятияКУчету ЕСТЬ NULL )
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство
	|АВТОУПОРЯДОЧИВАНИЕ";
	лЗапрос.УстановитьПараметр("Ссылка", Ссылка);
	лЗапрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПериодРегистрации));
	лЗапрос.УстановитьПараметр("Период", КонецМесяца(ПериодРегистрации));
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Пока лВыборка.Следующий() Цикл 
		Отказ = Истина;
		Сообщить("Для актива """+лВыборка.ОсновноеСредство+""" в этом месяце не предусмотрено начисление");
	КонецЦикла;
	// is ЯннуровВФ кон 20140522
	
	// is ЯннуровВФ нач 20140610 ЗР-0И-001397
	Движения.ОсновныеСредстваМеждународныйУчет.Записать();
	лЗапрос = Новый Запрос;
	лЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентов.ДС_ОбъектДоговора КАК ОсновноеСредство,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ПОМЕСТИТЬ втДоговоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ис_Продлен = ИСТИНА
	|	И ДоговорыКонтрагентов.ис_ДатаПродления МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	втДоговоры.Контрагент КАК Контрагент,
	|	втДоговоры.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&ОкончаниеПериода, ) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоговоры КАК втДоговоры
	|		ПО ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство = втДоговоры.ОсновноеСредство
	|ГДЕ
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийОС.ВведеноВЭксплуатацию)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство,
	|	Контрагент,
	|	Договор
	|АВТОУПОРЯДОЧИВАНИЕ";
	лЗапрос.УстановитьПараметр("Организация", Организация);
	лЗапрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	лЗапрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРегистрации));
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Если лВыборка.Количество() > 0 Тогда 
		Отказ = Истина;
		Сообщить("Следующие основные средства имеют продленные договоры, но не введены в эксплутацию", СтатусСообщения.Информация);
		Пока лВыборка.Следующий() Цикл 
			Сообщить(Строка(лВыборка.ОсновноеСредство)+" - "+Строка(лВыборка.Контрагент)+" / "+Строка(лВыборка.Договор));
		КонецЦикла;
		Возврат;
	КонецЕсли;
	// is ЯннуровВФ кон 20140610
	
	// is ЯннуровВФ нач 20140606 Получение параметров сезонности
	лЗапросСезонность = Новый Запрос;
	лЗапросСезонность.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДС_ОбъемВыпускаДляРасчетаАмортизацииОССрезПоследних.ПериодАмортизации КАК Период
	|ПОМЕСТИТЬ втПериоды
	|ИЗ
	|	РегистрСведений.ДС_ОбъемВыпускаДляРасчетаАмортизацииОС.СрезПоследних(, ПроизводственнаяЛиния = &ПроизводственнаяЛиния) КАК ДС_ОбъемВыпускаДляРасчетаАмортизацииОССрезПоследних
	|ГДЕ
	|	ДС_ОбъемВыпускаДляРасчетаАмортизацииОССрезПоследних.КоличествоВыпущеннойПродукции <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	втПериоды.Период
	|ИЗ
	|	втПериоды КАК втПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втПериоды.Период
	|ИЗ
	|	втПериоды КАК втПериоды
	|ГДЕ
	|	втПериоды.Период = &ПериодРегистрации";
	лЗапросСезонность.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	// is ЯннуровВФ кон 20140606
	
	// is ЯннуровВФ нач 20140606 Получение расходов будущих периодов
	лЗапросНастройкиРБП = Новый Запрос;
	лЗапросНастройкиРБП.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ис_ЗатратыБудущихПериодовМеждународный.РасходыБудущихПериодов
	|ИЗ
	|	РегистрСведений.ис_ЗатратыБудущихПериодовМеждународный КАК ис_ЗатратыБудущихПериодовМеждународный
	|ГДЕ
	|	ис_ЗатратыБудущихПериодовМеждународный.Организация = &Организация
	|	И ис_ЗатратыБудущихПериодовМеждународный.Подразделение = &Подразделение
	|	И ис_ЗатратыБудущихПериодовМеждународный.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	|	И ис_ЗатратыБудущихПериодовМеждународный.СтатьяЗатрат = &СтатьяЗатрат";
	лЗапросНастройкиРБП.УстановитьПараметр("Организация", Организация);
	// is ЯннуровВФ нач 20140606
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",      Ссылка);
	Запрос.УстановитьПараметр("Период",      КонецМесяца(ПериодРегистрации));
	// is ЯннуровВФ нач 20150220
	Запрос.УстановитьПараметр("ПериодСГраницей", Новый Граница(КонецМесяца(ПериодРегистрации), ВидГраницы.Включая));
	// is ЯннуровВФ кон 20150220
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
	"////////////////////////////////////////////////////////////////////////////////
	|// Выборка сведений об учетной политике
	|
	|ВЫБРАТЬ 
	|	УчетнаяПолитикаМеждународныйУчетСрезПоследних.МетодОценкиОсновныхСредств КАК МетодОценкиОсновныхСредств
	|ПОМЕСТИТЬ УчетнаяПолитика
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаМеждународныйУчет.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитикаМеждународныйУчетСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Выборка сведений об основных средствах из табличной части документа
	|
	|ВЫБРАТЬ
	|	АмортизацияОСМеждународныйОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	АмортизацияОСМеждународныйОсновныеСредства.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	АмортизацияОСМеждународныйОсновныеСредства.КоличествоВыпущеннойПродукции КАК КоличествоВыпущеннойПродукции
	|ПОМЕСТИТЬ СведенияДокумента
	|ИЗ
	|	Документ.АмортизацияОСМеждународный.ОсновныеСредства КАК АмортизацияОСМеждународныйОсновныеСредства
	|ГДЕ
	|	АмортизацияОСМеждународныйОсновныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Выборка сведений об основных средствах из информационной базы
	// is ЯннуровВФ нач 20150224
	//|ВЫБРАТЬ
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.ДатаПринятияКУчету КАК ДатаПринятияКУчету,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетУчета КАК СчетУчета,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.КоэффициентУскорения КАК КоэффициентУскорения,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.ПредполагаемыйОбъемПродукции КАК ПредполагаемыйОбъемПродукции,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СправедливаяСтоимость КАК СправедливаяСтоимость,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.МестонахождениеОбъекта КАК МестонахождениеОбъекта,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.МОЛ КАК МОЛ,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.НачислятьАмортизацию КАК НачислятьАмортизацию,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СуммаНачисленнойАмортизации КАК СуммаНачисленнойАмортизации,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.Состояние КАК Состояние,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто1 КАК Субконто1,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто2 КАК Субконто2,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто3 КАК Субконто3,
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.ис_Лизинг КАК ис_Лизинг
	//|ПОМЕСТИТЬ СведенияИнформационнойБазы
	//|ИЗ
	//|	РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&Период, ОсновноеСредство В	(ВЫБРАТЬ ОсновноеСредство ИЗ СведенияДокумента)) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних
	//|ГДЕ
	//|	ОсновныеСредстваМеждународныйУчетСрезПоследних.НачислятьАмортизацию = ИСТИНА
	|ВЫБРАТЬ
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.ОсновноеСредство, ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство) КАК ОсновноеСредство,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.ДатаПринятияКУчету, ОсновныеСредстваМеждународныйУчетСрезПоследних.ДатаПринятияКУчету) КАК ДатаПринятияКУчету,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.СрокПолезногоИспользования, ОсновныеСредстваМеждународныйУчетСрезПоследних.СрокПолезногоИспользования) КАК СрокПолезногоИспользования,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.СчетУчета, ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетУчета) КАК СчетУчета,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.СчетЗатрат, ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетЗатрат) КАК СчетЗатрат,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.СчетНачисленияАмортизации, ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетНачисленияАмортизации) КАК СчетНачисленияАмортизации,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.СчетСниженияСтоимости, ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетСниженияСтоимости) КАК СчетСниженияСтоимости,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.ЛиквидационнаяСтоимость, ОсновныеСредстваМеждународныйУчетСрезПоследних.ЛиквидационнаяСтоимость) КАК ЛиквидационнаяСтоимость,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.КоэффициентУскорения, ОсновныеСредстваМеждународныйУчетСрезПоследних.КоэффициентУскорения) КАК КоэффициентУскорения,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.ПредполагаемыйОбъемПродукции, ОсновныеСредстваМеждународныйУчетСрезПоследних.ПредполагаемыйОбъемПродукции) КАК ПредполагаемыйОбъемПродукции,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.ПервоначальнаяСтоимость, ОсновныеСредстваМеждународныйУчетСрезПоследних.ПервоначальнаяСтоимость) КАК ПервоначальнаяСтоимость,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.СправедливаяСтоимость, ОсновныеСредстваМеждународныйУчетСрезПоследних.СправедливаяСтоимость) КАК СправедливаяСтоимость,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.МестонахождениеОбъекта, ОсновныеСредстваМеждународныйУчетСрезПоследних.МестонахождениеОбъекта) КАК МестонахождениеОбъекта,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.МОЛ, ОсновныеСредстваМеждународныйУчетСрезПоследних.МОЛ) КАК МОЛ,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.НачислятьАмортизацию, ОсновныеСредстваМеждународныйУчетСрезПоследних.НачислятьАмортизацию) КАК НачислятьАмортизацию,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.СуммаНачисленнойАмортизации, ОсновныеСредстваМеждународныйУчетСрезПоследних.СуммаНачисленнойАмортизации) КАК СуммаНачисленнойАмортизации,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.Состояние, ОсновныеСредстваМеждународныйУчетСрезПоследних.Состояние) КАК Состояние,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.Субконто1, ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто1) КАК Субконто1,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.Субконто2, ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто2) КАК Субконто2,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.Субконто3, ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто3) КАК Субконто3,
	|	ISNULL(ОсновныеСредстваМеждународныйУчетСрезПоследних1.ис_Лизинг, ОсновныеСредстваМеждународныйУчетСрезПоследних.ис_Лизинг) КАК ис_Лизинг
	|ПОМЕСТИТЬ СведенияИнформационнойБазы
	|ИЗ
	|	РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&Период, ОсновноеСредство В	(ВЫБРАТЬ ОсновноеСредство ИЗ СведенияДокумента)) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(&Период, Регистратор ССЫЛКА Документ.АмортизацияОСМеждународный) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних1
	|		ПО ОсновныеСредстваМеждународныйУчетСрезПоследних.ОсновноеСредство = ОсновныеСредстваМеждународныйУчетСрезПоследних1.ОсновноеСредство
	|			И ОсновныеСредстваМеждународныйУчетСрезПоследних.Период = ОсновныеСредстваМеждународныйУчетСрезПоследних1.Период
	|ГДЕ
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.НачислятьАмортизацию = ИСТИНА
	// is ЯннуровВФ кон 20150224
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Сводная таблица со сведениями документа и информационной базы 
	|
	|ВЫБРАТЬ
	|	СведенияДокумента.*,
	|	СведенияИнформационнойБазы.*
	|ПОМЕСТИТЬ СведенияОС
	|ИЗ
	|	СведенияДокумента КАК СведенияДокумента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СведенияИнформационнойБазы КАК СведенияИнформационнойБазы
	|	ПО СведенияДокумента.ОсновноеСредство = СведенияИнформационнойБазы.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Выборка счетов учета основных средств
	|
	|ВЫБРАТЬ 
	|	СведенияОС.СчетУчета КАК Счет
	|ПОМЕСТИТЬ СчетаУчетаОС
	|ИЗ
	|	СведенияОС
	|ГДЕ
	|	МетодНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка)	
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	СведенияОС.СчетНачисленияАмортизации
	|ИЗ
	|	СведенияОС
	|ГДЕ
	|	МетодНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка)	
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияОС.СчетСниженияСтоимости
	|ИЗ
	|	СведенияОС
	|ГДЕ
	|	МетодНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка)	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Выборка остатков по счетам учета основных средств
	|
	|ВЫБРАТЬ
	|	МеждународныйОстатки.Субконто1 КАК ОсновноеСредство,
	|	МеждународныйОстатки.Счет КАК Счет,
	|	МеждународныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
	|	МеждународныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт
	|ПОМЕСТИТЬ ОстаткиПоСчетамОС
	|ИЗ
	// is ЯннуровВФ нач 20150220
	//|	РегистрБухгалтерии.Международный.Остатки(&Период, Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ Счет Из СчетаУчетаОС), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства), Организация = &Организация И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СведенияОС ГДЕ МетодНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка))) КАК МеждународныйОстатки
	|	РегистрБухгалтерии.Международный.Остатки(&ПериодСГраницей, Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ Счет Из СчетаУчетаОС), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства), Организация = &Организация И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СведенияОС ГДЕ МетодНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка))) КАК МеждународныйОстатки
	// is ЯннуровВФ кон 20150220
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Сведения об основных средствах, амортизация по которым начисляется методом
	|// уменьшаемого остатка
	|
	|ВЫБРАТЬ
	|	СчетаУчетаОССрезПоследних.ОсновноеСредство,
	|	СчетаУчетаОССрезПоследних.Период,
	|	ОсновныеСредстваМеждународныйУчет.СчетУчета,
	|	ОсновныеСредстваМеждународныйУчет.СчетНачисленияАмортизации,
	|	ОсновныеСредстваМеждународныйУчет.СчетСниженияСтоимости
	|ПОМЕСТИТЬ СведенияОСМетодУменьшаемогоОстатка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДатыСнятияОстатков.ОсновноеСредство КАК ОсновноеСредство,
	|		ДатыСнятияОстатков.Период КАК Период,
	|		МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Период) КАК ПериодСрезаПоследних
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ИзменениеСтоимостиОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|			ВЫБОР КОГДА ИзменениеСтоимостиОССрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, ГОД)
	|				ТОГДА ИзменениеСтоимостиОССрезПоследних.Период
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(&Период, ГОД)
	|			КОНЕЦ КАК Период
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ИзменениеСтоимостиОССрезПервых.ОсновноеСредство КАК ОсновноеСредство,
	|				МАКСИМУМ(ИзменениеСтоимостиОССрезПервых.Период) КАК Период
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ОсновныеСредстваМеждународныйУчет.ОсновноеСредство КАК ОсновноеСредство,
	|					МИНИМУМ(ОсновныеСредстваМеждународныйУчет.Период) КАК Период
	|				ИЗ
	|					РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
	|				ГДЕ
	|					ОсновныеСредстваМеждународныйУчет.ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СведенияОС ГДЕ МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка))
	|					И ОсновныеСредстваМеждународныйУчет.Период <= &Период
	|			
	|				СГРУППИРОВАТЬ ПО
	|					ОсновныеСредстваМеждународныйУчет.ОсновноеСредство,
	|					ОсновныеСредстваМеждународныйУчет.ПервоначальнаяСтоимость,
	|					ОсновныеСредстваМеждународныйУчет.СправедливаяСтоимость) КАК ИзменениеСтоимостиОССрезПервых
	|  		
	|			СГРУППИРОВАТЬ ПО
	|				ИзменениеСтоимостиОССрезПервых.ОсновноеСредство) КАК ИзменениеСтоимостиОССрезПоследних
	|		) КАК ДатыСнятияОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
	|		ПО ДатыСнятияОстатков.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
	|		 И ДатыСнятияОстатков.Период >= ОсновныеСредстваМеждународныйУчет.Период
	|	СГРУППИРОВАТЬ ПО
	|		ДатыСнятияОстатков.ОсновноеСредство,
	|		ДатыСнятияОстатков.Период) КАК СчетаУчетаОССрезПоследних
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
	|	ПО СчетаУчетаОССрезПоследних.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
	|	 И СчетаУчетаОССрезПоследних.ПериодСрезаПоследних = ОсновныеСредстваМеждународныйУчет.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Выборка счетов учета основных средств, амортизация по которым начисляется
	|// методом уменьшаемого остатка
	|
	|ВЫБРАТЬ 
	|	СведенияОСМетодУменьшаемогоОстатка.СчетУчета КАК Счет
	|ПОМЕСТИТЬ СчетаУчетаОСМетодУменьшаемогоОстатка
	|ИЗ
	|	СведенияОСМетодУменьшаемогоОстатка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	СведенияОСМетодУменьшаемогоОстатка.СчетНачисленияАмортизации
	|ИЗ
	|	СведенияОСМетодУменьшаемогоОстатка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	СведенияОСМетодУменьшаемогоОстатка.СчетСниженияСтоимости
	|ИЗ
	|	СведенияОСМетодУменьшаемогоОстатка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Выборка движений по счетам учета основных средств 
	|// (метод уменьшаемого остатка).
	|
	|ВЫБРАТЬ
	|	МеждународныйОстаткиИОбороты.Субконто1 КАК ОсновноеСредство,
	|	МеждународныйОстаткиИОбороты.Счет КАК Счет,
	|	МеждународныйОстаткиИОбороты.Период КАК Период,
	|	МеждународныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаОстатокДт,
	|	МеждународныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаОстатокКт
	|ПОМЕСТИТЬ ДвиженияПоСчетамОС
	|ИЗ
	|   РегистрБухгалтерии.Международный.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&Период, ГОД), &Период, Запись, , Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ Счет Из СчетаУчетаОСМетодУменьшаемогоОстатка), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства), Организация = &Организация И Субконто1 В (ВЫБРАТЬ ОсновноеСредство ИЗ СведенияОС ГДЕ МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка))) КАК МеждународныйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Выборка остатков по счетам учета основных средств, амортизация по которым
	|// начисляется методом уменьшаемого остатка
	|
	|ВЫБРАТЬ
	|	ДвиженияПоСчетамОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ДвиженияПоСчетамОССрезПоследних.Счет КАК Счет,
	|	ДвиженияПоСчетамОС.СуммаОстатокДт КАК СуммаОстатокДт,
	|	ДвиженияПоСчетамОС.СуммаОстатокКт КАК СуммаОстатокКт
	|ПОМЕСТИТЬ ОстаткиПоСчетамОСУменьшаемогоОстатка
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОСМетодУменьшаемогоОстатка.ОсновноеСредство КАК ОсновноеСредство,
	|		ДвиженияПоСчетамОС.Счет КАК Счет,
	|		МАКСИМУМ(ДвиженияПоСчетамОС.Период) КАК Период
	|	ИЗ
	|		СведенияОСМетодУменьшаемогоОстатка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияПоСчетамОС КАК ДвиженияПоСчетамОС
	|		ПО СведенияОСМетодУменьшаемогоОстатка.Период >= ДвиженияПоСчетамОС.Период
	|		 И СведенияОСМетодУменьшаемогоОстатка.ОсновноеСредство = ДвиженияПоСчетамОС.ОсновноеСредство
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОСМетодУменьшаемогоОстатка.ОсновноеСредство,
	|		ДвиженияПоСчетамОС.Счет) КАК ДвиженияПоСчетамОССрезПоследних
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияПоСчетамОС КАК ДвиженияПоСчетамОС
	|	ПО ДвиженияПоСчетамОССрезПоследних.Период = ДвиженияПоСчетамОС.Период
	|	 И ДвиженияПоСчетамОССрезПоследних.ОсновноеСредство = ДвиженияПоСчетамОС.ОсновноеСредство
	|	 И ДвиженияПоСчетамОССрезПоследних.Счет = ДвиженияПоСчетамОС.Счет
	|";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияОС.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	СведенияОС.КоличествоВыпущеннойПродукции КАК КоличествоВыпущеннойПродукции,
	|	СведенияОС.ДатаПринятияКУчету КАК ДатаПринятияКУчету,
	|	СведенияОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	СведенияОС.СчетУчета КАК СчетУчета,
	|	СведенияОС.СчетЗатрат КАК СчетЗатрат,
	|	СведенияОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	|	СведенияОС.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
	|	СведенияОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	СведенияОС.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СведенияОС.ПредполагаемыйОбъемПродукции КАК ПредполагаемыйОбъемПродукции,
	|	СведенияОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	СведенияОС.СправедливаяСтоимость КАК СправедливаяСтоимость,
	|	СведенияОС.МестонахождениеОбъекта КАК МестонахождениеОбъекта,
	|	СведенияОС.МОЛ КАК МОЛ,
	|	СведенияОС.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	СведенияОС.СуммаНачисленнойАмортизации КАК СуммаНачисленнойАмортизации,
	|	СведенияОС.Состояние КАК Состояние,
	|	СведенияОС.Субконто1 КАК Субконто1,
	|	СведенияОС.Субконто2 КАК Субконто2,
	|	СведенияОС.Субконто3 КАК Субконто3,
	|	СведенияОС.ис_Лизинг КАК ис_Лизинг,
	|	ЕСТЬNULL(СтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаОстатокКт, 0) - ЕСТЬNULL(СнижениеСтоимостиОС.СуммаОстатокКт, 0) КАК ОстаточнаяСтоимость,
	|	УчетнаяПолитика.МетодОценкиОсновныхСредств КАК МетодОценкиОсновныхСредств,
	|	0 КАК Месяц
	|ИЗ
	|	СведенияОС КАК СведенияОС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамОС КАК СтоимостьОС
	|	ПО СведенияОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство
	|	 И СведенияОС.СчетУчета = СтоимостьОС.Счет
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамОС КАК АмортизацияОС
	|	ПО СведенияОС.ОсновноеСредство = АмортизацияОС.ОсновноеСредство
	|	 И СведенияОС.СчетНачисленияАмортизации = АмортизацияОС.Счет
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамОС КАК СнижениеСтоимостиОС
	|	ПО СведенияОС.ОсновноеСредство = СнижениеСтоимостиОС.ОсновноеСредство
	|	 И СведенияОС.СчетСниженияСтоимости = СнижениеСтоимостиОС.Счет,
	|	УчетнаяПолитика
	|ГДЕ 
	|	СведенияОС.МетодНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка)	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияОС.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
	|	СведенияОС.КоличествоВыпущеннойПродукции КАК КоличествоВыпущеннойПродукции,
	|	СведенияОС.ДатаПринятияКУчету КАК ДатаПринятияКУчету,
	|	СведенияОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	СведенияОС.СчетУчета КАК СчетУчета,
	|	СведенияОС.СчетЗатрат КАК СчетЗатрат,
	|	СведенияОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	|	СведенияОС.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
	|	СведенияОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	СведенияОС.КоэффициентУскорения КАК КоэффициентУскорения,
	|	СведенияОС.ПредполагаемыйОбъемПродукции КАК ПредполагаемыйОбъемПродукции,
	|	СведенияОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	СведенияОС.СправедливаяСтоимость КАК СправедливаяСтоимость,
	|	СведенияОС.МестонахождениеОбъекта КАК МестонахождениеОбъекта,
	|	СведенияОС.МОЛ КАК МОЛ,
	|	СведенияОС.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	СведенияОС.СуммаНачисленнойАмортизации КАК СуммаНачисленнойАмортизации,
	|	СведенияОС.Состояние КАК Состояние,
	|	СведенияОС.Субконто1 КАК Субконто1,
	|	СведенияОС.Субконто2 КАК Субконто2,
	|	СведенияОС.Субконто3 КАК Субконто3,
	|	СведенияОС.ис_Лизинг КАК ис_Лизинг,
	|	ЕСТЬNULL(СтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаОстатокКт, 0) - ЕСТЬNULL(СнижениеСтоимостиОС.СуммаОстатокКт, 0) КАК ОстаточнаяСтоимость,
	|	УчетнаяПолитика.МетодОценкиОсновныхСредств КАК МетодОценкиОсновныхСредств,
	|	МЕСЯЦ(СведенияОСМетодУменьшаемогоОстатка.Период) КАК Месяц
	|ИЗ
	|	СведенияОС КАК СведенияОС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамОСУменьшаемогоОстатка КАК СтоимостьОС
	|	ПО СведенияОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство
	|	 И СведенияОС.СчетУчета = СтоимостьОС.Счет
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамОСУменьшаемогоОстатка КАК АмортизацияОС
	|	ПО СведенияОС.ОсновноеСредство = АмортизацияОС.ОсновноеСредство
	|	 И СведенияОС.СчетНачисленияАмортизации = АмортизацияОС.Счет
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоСчетамОСУменьшаемогоОстатка КАК СнижениеСтоимостиОС
	|	ПО СведенияОС.ОсновноеСредство = СнижениеСтоимостиОС.ОсновноеСредство
	|	 И СведенияОС.СчетСниженияСтоимости = СнижениеСтоимостиОС.Счет,
	|	ЛЕВОЕ СОЕДИНЕНИЕ СведенияОСМетодУменьшаемогоОстатка КАК СведенияОСМетодУменьшаемогоОстатка
	|	ПО СведенияОС.ОсновноеСредство = СведенияОСМетодУменьшаемогоОстатка.ОсновноеСредство,
	|	УчетнаяПолитика
	|ГДЕ 
	|	СведенияОС.МетодНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка)	
	|";
	ВыборкаОС = Запрос.Выполнить().Выбрать();
	
	Счета = ПланыСчетов.Международный;
	
	// рассчитываем сальдо по резерву переоценки - для списания пропрционально амортизации
	БухИтогиР = Обработки.БухгалтерскиеИтоги.Создать();
	Резервы = Справочники.ВидыФинРезервов.РезервыНаПереоценку;
	МассивСубконто = Новый Массив();
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Резервы);
	//начало изменений ДС МСФО 04.12.2013
	//СчетРезервыНаПереоценку = ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС;
	//БухИтогиР.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет, Субконто1, Субконто2", Дата, Дата, , ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, МассивСубконто, , , "Организация", Организация);
	//конец изменений ДС МСФО 04.12.2013
		    	
	Пока ВыборкаОС.Следующий() Цикл
		
		// is ЯннуровВФ нач 20141017
		лДоговорЛизинга = ис_Международный.ПолучитьДоговорЛизингаОС(ВыборкаОС.ОсновноеСредство);
		// is ЯннуровВФ кон 20141017
		
		Сумма                     = 0;
		СчетУчета                 = ВыборкаОС.СчетУчета;
		СчетЗатрат                = ВыборкаОС.СчетЗатрат;
		СчетНачисленияАмортизации = ВыборкаОС.СчетНачисленияАмортизации;
		СчетСниженияСтоимости     = ВыборкаОС.СчетСниженияСтоимости;
		ДатаУстановки             = НачалоМесяца(ВыборкаОС.ДатаПринятияКУчету);
		ОставшеесяЧислоМесяцев    = ВыборкаОС.СрокПолезногоИспользования - ((Месяц(ПериодРегистрации) + 12*Год(ПериодРегистрации)- (Месяц(ДатаУстановки) + 12*Год(ДатаУстановки)))) + 1;
		// is ЯннуровВФ нач 20150220
		//// is ЯннуровВФ нач 20141017
		//Если ЗначениеЗаполнено(лДоговорЛизинга) 
		// И лДоговорЛизинга.ис_Продлен Тогда 
		//	ОставшеесяЧислоМесяцев = ОставшеесяЧислоМесяцев - 1;
		//КонецЕсли;
		//// is ЯннуровВФ кон 20141017
		// is ЯннуровВФ кон 20150220
		Если ВыборкаОС.МетодНачисленияАмортизации = Перечисления.МетодыНачисленияАмортизацииОСМеждународный.Линейный Тогда
			
			Если ОставшеесяЧислоМесяцев > 0 Тогда
				Сумма = (ВыборкаОС.ОстаточнаяСтоимость - ВыборкаОС.ЛиквидационнаяСтоимость) / ОставшеесяЧислоМесяцев;
			Иначе
				Сообщить("По объекту ОС '" + ВыборкаОС.ОсновноеСредство + "' амортизация не начислена:");
				Сообщить("	истек срок полезного использования");
			КонецЕсли;
			
		ИначеЕсли ВыборкаОС.МетодНачисленияАмортизации = Перечисления.МетодыНачисленияАмортизацииОСМеждународный.УменьшаемогоОстатка Тогда
			
			Сумма = ВыборкаОС.ОстаточнаяСтоимость * ВыборкаОС.КоэффициентУскорения * 12 / ВыборкаОС.СрокПолезногоИспользования / (12 - ВыборкаОС.Месяц + 1);
					
		ИначеЕсли ВыборкаОС.МетодНачисленияАмортизации = Перечисления.МетодыНачисленияАмортизацииОСМеждународный.ПропорциональноОбъемуПродукции Тогда

			// is ЯннуровВФ нач 20140606 Типовое поведение
			////начало изменений ДС МСФО 06.12.2013
			////Если ВыборкаОС.ПредполагаемыйОбъемПродукции = 0 Тогда
			////	
			////	Сообщить("По объекту ОС '" + ВыборкаОС.ОсновноеСредство + "' амортизация не начислена:");
			////	Сообщить("	в регистре сведений не указан предполагаемый объем продукции");
			////	
			////ИначеЕсли ВыборкаОС.КоличествоВыпущеннойПродукции >	ВыборкаОС.ПредполагаемыйОбъемПродукции Тогда
			////	
			////	Сообщить("По объекту ОС '" + ВыборкаОС.ОсновноеСредство + "' амортизация не начислена:");
			////	Сообщить("	в регистре сведений указан предполагаемый объем продукции " + ВыборкаОС.ПредполагаемыйОбъемПродукции + ", в документе - больше: " + ВыборкаОС.КоличествоВыпущеннойПродукции);
			////	
			////Иначе
			////	
			////	Если ВыборкаОС.МетодОценкиОсновныхСредств = Перечисления.МетодыОценкиАктивов.ПоПервоначальнойСтоимости Тогда
			////		Сумма = ВыборкаОС.ПервоначальнаяСтоимость * ВыборкаОС.КоличествоВыпущеннойПродукции / ВыборкаОС.ПредполагаемыйОбъемПродукции;
			////	ИначеЕсли ВыборкаОС.МетодОценкиОсновныхСредств = Перечисления.МетодыОценкиАктивов.ПоСправедливойСтоимости Тогда
			////		Сумма = ВыборкаОС.СправедливаяСтоимость * ВыборкаОС.КоличествоВыпущеннойПродукции / ВыборкаОС.ПредполагаемыйОбъемПродукции;
			////	Иначе
			////		Сообщить("В учетной политике по международному учету не указан Метод учета основных средств. ОС " + ВыборкаОС.ОсновноеСредство + " не амортизировано.", СтатусСообщения.ОченьВажное);
			////	КонецЕсли;
			////	
			////КонецЕсли;
			//
			//
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	СрезПоследних.ПериодАмортизации,
			//|	СрезПоследних.КоличествоВыпущеннойПродукции,
			//|	СрезПоследних.СуммаАмортизации КАК Сумма
			//|ИЗ
			//|	РегистрСведений.ДС_РасчетАмортизацииОСПропорциональноОбъемуВыпуска.СрезПоследних(
			//|			КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
			//|			ОсновноеСредство = &ОсновноеСредство
			//|				И ПериодАмортизации = &Период) КАК СрезПоследних";
			//
			//Запрос.УстановитьПараметр("Период", 			НачалоМесяца(ПериодРегистрации));
			//Запрос.УстановитьПараметр("ОсновноеСредство", 	ВыборкаОС.ОсновноеСредство);
			//Результат = Запрос.Выполнить();
			//
			//Если Результат.Пустой() Тогда
			//	Сообщить("По объекту ОС '" + ВыборкаОС.ОсновноеСредство + "' амортизация не начислена:");
			//	Сообщить("	не указан плановый выпуск продукции");
			//	
			//Иначе
			//	Выборка = Результат.Выбрать();
			//	Выборка.Следующий();
			//	Сумма = Выборка.Сумма;
			//КонецЕсли;
			////конец изменений ДС МСФО 06.12.2013
			
			Если ВыборкаОС.ПредполагаемыйОбъемПродукции = 0 Тогда
				
				Сообщить("По объекту ОС '" + ВыборкаОС.ОсновноеСредство + "' амортизация не начислена:");
				Сообщить("	в регистре сведений не указан предполагаемый объем продукции");
				
			ИначеЕсли ВыборкаОС.КоличествоВыпущеннойПродукции >	ВыборкаОС.ПредполагаемыйОбъемПродукции Тогда
				
				Сообщить("По объекту ОС '" + ВыборкаОС.ОсновноеСредство + "' амортизация не начислена:");
				Сообщить("	в регистре сведений указан предполагаемый объем продукции " + ВыборкаОС.ПредполагаемыйОбъемПродукции + ", в документе - больше: " + ВыборкаОС.КоличествоВыпущеннойПродукции);
				
			Иначе
				
				Если ВыборкаОС.МетодОценкиОсновныхСредств = Перечисления.МетодыОценкиАктивов.ПоПервоначальнойСтоимости Тогда
					Сумма = ВыборкаОС.ПервоначальнаяСтоимость * ВыборкаОС.КоличествоВыпущеннойПродукции / ВыборкаОС.ПредполагаемыйОбъемПродукции;
				ИначеЕсли ВыборкаОС.МетодОценкиОсновныхСредств = Перечисления.МетодыОценкиАктивов.ПоСправедливойСтоимости Тогда
					Сумма = ВыборкаОС.СправедливаяСтоимость * ВыборкаОС.КоличествоВыпущеннойПродукции / ВыборкаОС.ПредполагаемыйОбъемПродукции;
				Иначе
					Сообщить("В учетной политике по международному учету не указан Метод учета основных средств. ОС " + ВыборкаОС.ОсновноеСредство + " не амортизировано.", СтатусСообщения.ОченьВажное);
				КонецЕсли;
				
			КонецЕсли;
			// is ЯннуровВФ кон 20140606
			
		КонецЕсли;
				
		Сумма = Мин (Сумма, ВыборкаОС.ОстаточнаяСтоимость);
		Если (ЗначениеЗаполнено(СчетЗатрат)) 
			и (ЗначениеЗаполнено(СчетНачисленияАмортизации)) 
			и (Сумма <> 0) Тогда
			
			// is ЯннуровВФ нач 20140606
			Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			СтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка();
			НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
			Для Ном = 1 по СчетЗатрат.ВидыСубконто.Количество() Цикл
				ЗначениеСубконто = ВыборкаОС["Субконто" + Ном];
				Если ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
					Подразделение = ЗначениеСубконто;
				ИначеЕсли ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
					СтатьяЗатрат = ЗначениеСубконто;
				ИначеЕсли ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
					НоменклатурнаяГруппа = ЗначениеСубконто;
				КонецЕсли;
			КонецЦикла;
			
			лЗапросСезонность.УстановитьПараметр("ПроизводственнаяЛиния", Подразделение);
			лРезультатыЗапроса = лЗапросСезонность.ВыполнитьПакет();
			лСезонноеОС = Не лРезультатыЗапроса[1].Пустой();
			лОСВСезоне = Не лРезультатыЗапроса[2].Пустой();
			Если лСезонноеОС И Не лОСВСезоне Тогда 
				
				лДвижение = Движения.ис_РасходыБудущихПериодовМеждународныйУчет.Добавить();
				лДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
				лДвижение.Период = КонецМесяца(ПериодРегистрации);
				лДвижение.Организация = Организация;
				лДвижение.Подразделение = Подразделение;
				лДвижение.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
				лДвижение.СтатьяЗатрат = СтатьяЗатрат;
				лДвижение.Сумма = Сумма;
				
				лРасходыБудущихПериодов = ис_Международный.ПолучитьЭлементРБП(Организация, Подразделение, НоменклатурнаяГруппа, СтатьяЗатрат, Истина);
				лПроводка = Движения.Международный.Добавить();
				лПроводка.Период = КонецМесяца(ПериодРегистрации);
				лПроводка.Организация = Организация;
				// is ЯннуровВФ нач 20141113
				//лПроводка.СчетДт = ПланыСчетов.Международный._РасходыБудущихПериодов;
				лПроводка.СчетДт = ПланыСчетов.Международный._ПрочиеРасходыБудущихПериодов;
				// is ЯннуровВФ кон 20141113
				лПроводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.РасходыБудущихПериодов] = лРасходыБудущихПериодов;
				лПроводка.СчетКт = СчетНачисленияАмортизации;
				Если не лПроводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
					лПроводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ВыборкаОС.ОсновноеСредство;
				КонецЕсли;
				лПроводка.Сумма = Сумма;
				лПроводка.Содержание = "Амортизация ОС";
				лПроводка.НомерЖурнала = "Рег";
				
			Иначе
			// is ЯннуровВФ кон 20140606
			
				Движение = Движения.Международный.Добавить();
				Движение.Период = КонецМесяца(ПериодРегистрации);
				Движение.СчетДт = СчетЗатрат;
				Движение.СчетКт = СчетНачисленияАмортизации;
				Движение.Организация = Организация;
				Движение.Сумма = Сумма;
				Движение.Содержание = "Амортизация ОС";
				Движение.НомерЖурнала = "Рег";
				
				// is ЯннуровВФ нач 20140606
				//СтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка();
				//НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
				// is ЯннуровВФ кон 20140606
				
				Для Ном = 1 по Движение.СчетДт.ВидыСубконто.Количество() Цикл
					ЗначениеСубконто = ВыборкаОС["Субконто" + Ном];
					//>>180716 Степанов 52764
					Если ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
						Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = ЗначениеСубконто;
					ИначеЕсли ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
						Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = ЗначениеСубконто;
					ИначеЕсли ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
						Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = ЗначениеСубконто;
					Иначе
						//>>Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = ЗначениеСубконто;
						БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, Ном, ЗначениеСубконто);
					КонецЕсли;
					//<<180716 Степанов 52764
					// is ЯннуровВФ нач 20140606
					//Если ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
					//	СтатьяЗатрат = ЗначениеСубконто;
					//ИначеЕсли ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
					//	НоменклатурнаяГруппа = ЗначениеСубконто;
					//КонецЕсли;
					// is ЯннуровВФ кон 20140606
				КонецЦикла;
				
				Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ВыборкаОС.ОсновноеСредство;
				КонецЕсли;
			
				//начало изменений ДС МСФО 03.12.2013
				//Если СчетЗатрат = Счета.ОсновноеПроизводство или СчетЗатрат = Счета.ВспомогательноеПроизводство или СчетЗатрат = Счета.ОбслуживающиеПроизводства Тогда
				// is ЯннуровВФ нач 20140709 Неверное имя счета
				//Если СчетЗатрат = Счета.ОсновноеПроизводство или СчетЗатрат = Счета.ОбслуживающиеПроизводства Тогда
				Если СчетЗатрат = Счета._ОсновноеПроизводство 
				 Или СчетЗатрат = Счета.ВспомогательныеПроизводства
				 Или СчетЗатрат = Счета.ОбслуживающиеПроизводства Тогда
				// is ЯннуровВФ кон 20140709
				//конец изменений ДС МСФО 03.12.2013
					// НезавершенноеПроизводствоМеждународныйУчет
					Движение = Движения.НезавершенноеПроизводствоМеждународныйУчет.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = КонецМесяца(ПериодРегистрации);
					Движение.Организация = Организация;
					// is ЯннуровВФ нач 20141007
					//Движение.Подразделение = ВыборкаОС.МестонахождениеОбъекта;
					Движение.Подразделение = Подразделение;
					// is ЯннуровВФ кон 20141007
					Движение.СчетУчета = СчетЗатрат;
					Движение.СтатьяЗатрат = СтатьяЗатрат;
					Движение.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
					Движение.Стоимость = Сумма;
					Движение.КодОперации = Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеПрочихЗатратВПроизводство;
					
				ИначеЕсли СчетЗатрат = Счета.ОбщепроизводственныеРасходы
				// is ЯннуровВФ нач 20140709 
				 Или СчетЗатрат = Счета.АдминистративныеРасходы 
				 Или СчетЗатрат = Счета._ИздержкиОбращения 
				 Или СчетЗатрат = Счета._КоммерческиеРасходы Тогда 
				// is ЯннуровВФ кон 20140709
					// ЗатратыМеждународныйУчет
					Движение = Движения.ЗатратыМеждународныйУчет.Добавить();
					Движение.Период = КонецМесяца(ПериодРегистрации);
					Движение.Организация = Организация;
					// is ЯннуровВФ нач 20141007
					//Движение.Подразделение = ВыборкаОС.МестонахождениеОбъекта;
					Движение.Подразделение = Подразделение;
					// is ЯннуровВФ кон 20141007
					Движение.СчетУчета = СчетЗатрат;
					Движение.СтатьяЗатрат = СтатьяЗатрат;
					Движение.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
					Движение.Сумма = Сумма;
					Движение.КодОперации = Перечисления.КодыОперацийЗатраты.ПрочиеПостоянныеЗатраты;

				КонецЕсли;
				
			КонецЕсли;
			
			// если есть резерв переоценки по данному объекту - списываем его часть на нераспределенную прибыль
			// пропорционально начисленной амортизации
			//начало изменений ДС МСФО 04.12.2013
			//СуммаРезерва = БухИтогиР.ПолучитьИтог("СуммаКонечныйОстатокКт", "Субконто1, Субконто2", ВыборкаОС.ОсновноеСредство, Резервы);
			//Если СуммаРезерва>0 Тогда
			//	//вычисляем сумму списания резерва
			//	СумммаСписания =  СуммаРезерва*Сумма/ВыборкаОС.ОстаточнаяСтоимость;
			//	//если стоимость полностью амортизирована, резерв должен быть списан полностью
			//	Если Сумма = ВыборкаОС.ОстаточнаяСтоимость Тогда
			//		СумммаСписания =  СуммаРезерва;  // чтобы не было остатков резерва из-за округления при расчете
			//	КонецЕсли;	
			//	//и делаем проводку по списанию резерва
			//	Движение = Движения.Международный.Добавить();
			//	Движение.Период = КонецМесяца(ПериодРегистрации);
			//	Движение.Организация = Организация;
			//	Движение.СчетДт = ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС;
			//	Движение.СчетКт = ПланыСчетов.Международный.НераспределеннаяПрибыль;
			//	УстановитьСубконтоПроводки(Движение.СубконтоДт, Движение.СчетДт, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, ВыборкаОС.ОсновноеСредство);
			//	УстановитьСубконтоПроводки(Движение.СубконтоДт, Движение.СчетДт, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Резервы, Справочники.ВидыФинРезервов.РезервыНаПереоценку);
			//	Движение.Сумма = СумммаСписания;
			//	Движение.Содержание = "Списание резерва переоценки ОС";
			//	Движение.НомерЖурнала = "Рег";
			//КонецЕсли;	
			//конец изменений ДС МСФО 04.12.2013
			
			// регистр ОсновныеСредстваМеждународныйУчет 
			Движение = Движения.ОсновныеСредстваМеждународныйУчет.Добавить();
			Движение.Период = КонецМесяца(ПериодРегистрации);
			Движение.ОсновноеСредство = ВыборкаОС.ОсновноеСредство;
			Движение.Организация = Организация;
			Движение.ДатаПринятияКУчету = ВыборкаОС.ДатаПринятияКУчету;
			Движение.МестонахождениеОбъекта = ВыборкаОС.МестонахождениеОбъекта;
			Движение.МОЛ = ВыборкаОС.МОЛ;
			Движение.СчетУчета = ВыборкаОС.СчетУчета;
			Движение.СрокПолезногоИспользования = ВыборкаОС.СрокПолезногоИспользования;
			Движение.НачислятьАмортизацию = ВыборкаОС.НачислятьАмортизацию;
			Движение.МетодНачисленияАмортизации = ВыборкаОС.МетодНачисленияАмортизации;
			Движение.СчетНачисленияАмортизации = ВыборкаОС.СчетНачисленияАмортизации;
			Движение.ПервоначальнаяСтоимость = ВыборкаОС.ПервоначальнаяСтоимость;
			Движение.ЛиквидационнаяСтоимость = ВыборкаОС.ЛиквидационнаяСтоимость;
			Движение.СчетЗатрат = ВыборкаОС.СчетЗатрат;
			Движение.Субконто1 = ВыборкаОС.Субконто1;
			Движение.Субконто2 = ВыборкаОС.Субконто2;
			Движение.Субконто3 = ВыборкаОС.Субконто3;
			Движение.ПредполагаемыйОбъемПродукции = ВыборкаОС.ПредполагаемыйОбъемПродукции;
			Движение.СуммаНачисленнойАмортизации = ВыборкаОС.СуммаНачисленнойАмортизации + Сумма;
			Движение.СправедливаяСтоимость = ВыборкаОС.СправедливаяСтоимость;
			Движение.Состояние = ВыборкаОС.Состояние;
			Движение.СчетСниженияСтоимости = ВыборкаОС.СчетСниженияСтоимости;
			Движение.КоэффициентУскорения = ВыборкаОС.КоэффициентУскорения;
			// is ЯннуровВФ нач 20140523 ЗР-0И-001239
			Движение.ис_Лизинг = ВыборкаОС.ис_Лизинг;
			// is ЯннуровВФ кон 20140523
	                                    			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;


	 
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью
